Tekla Open API Reference for Tekla Structures 2025
Text.TextAttributes.TransparentBackground Property
 Gets or sets a value indicating whether the background transparency is enabled for texts.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool TransparentBackground { get; set; }
Public Property TransparentBackground As Boolean
	Get
	Set
Property Value
Type: Boolean
 The text background transparency. (transparent/opaque)
See Also
Reference
Text.TextAttributes Class
Tekla.Structures.Drawing Namespace